Revit 2024 API
BuiltInFailures.StairRampFailures.RailingCurvesNotSplitStairs Property
 The slope of this railing may not parallel the stairs at runs and landings. To get a parallel railing, split the railing sketch at the ends of landings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId RailingCurvesNotSplitStairs { get; }
Visual Basic
Public Shared ReadOnly Property RailingCurvesNotSplitStairs As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ RailingCurvesNotSplitStairs {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace